public interface LabInterface 
{
    public boolean insert(Student S);
    //• Εισαγωγή φοιτητή στο εργαστηριακό τµήµα 
    public boolean delete(Student S);
    //• ∆ιαγραφή φοιτητή από το τµήµα
    public Student search(int AM);
    //• Αναζήτηση φοιτητή µε βάση το αριθµό µητρώου 
    public void presentation();
    //• Εκτύπωση παρουσιολόγιου για το τµήµα ( α.µ. φοιτητή - επώνυµο και όνοµα φοιτητή–αριθµός παρουσιών – βαθµός)
    public int succeded();
    //• Επιστροφή πλήθους τον φοιτητών του εργαστηριακού τµήµατος που πέτυχαν στο µάθηµα 
    public int failed();
    //• Επιστροφή πλήθους των φοιτητών του εργαστηριακού τµήµατος που απέτυχαν στο µάθηµα 
    public double averageGrade();
    //• Επιστροφή του µέσου όρου βαθµολογίας των φοιτητών του εργαστηριακού τµήµατος 
}
