/*
Ένα δυαδικό δέντρο ονομάζεται Σωρός(heap) μεγίστων(ή ελαχίστων) 
όταν ισχύουν οι  επιπλέον παρακάτω προυποθέσεις:
(α) το Δυαδικό Δέντρο είναι σχεδόν πλήρες(έχει όλους τουσ κόμβους επιπέδου N-1 ...)
(β) οι τιμές των κόμβων είναι τοποθετημένες με τέτοιο τρόπο ώστε ο κάθε κόμβος
πατέρας να έχει μεγαλύτερη(ή μικρότερη) τιμή από τα παιδιά του.
*/
public interface HeapInterface 
{
    public int size();
    //Επιστρέφει το μέγεθος του σωρού (αριθμό των στοιχείων του).
    
    public boolean isEmpty();
    //Επιστρέφει true αν ο σωρός είναι άδειος, false στην αντίθετη περίπτωση.
    
    public boolean isFull();
    //Επιστρέφει true αν ο σωρός είναι γεμάτος, αλλιώς false άν είναι άδειος.
    //(υπερχείλιση σωρού).
    
    public void insert(Object item) throws HeapFullException;
    //Εισάγει ένα νέο στοιχείο στο σωρό.
    
    public Object remove() throws HeapEmptyException;
    //Διαγράφει και επιστρέφει το στοιχείο που βρίσκεται στη ρίζα του σωρού.
    
    public Object[] HeapSort();
    //Ταξινομεί όλα τα στοιχεία του Σωρού(Heap) κατά αύξουσα (ή φθίνουσα) σειρά.
}
